out/thread_100/fresh/foundationdb/memory/use_cache/b/out_run.txt
normal
normal
normal
[...]
start running at 2024.02.21.09:05:13
start running at 2024.02.21.09:05:13
start running at 2024.02.21.09:05:13
[...]
amd64
/lib/linux/amd64/libfdb_c.so
amd64
/lib/linux/amd64/libfdb_java.so
Open normal subspace
Open normal subspace
Open normal subspace
[...]
Finish running at 2024.02.21.09:07:36
Finish running at 2024.02.21.09:07:37
Finish running at 2024.02.21.09:07:38
Finish running at 2024.02.21.09:07:38
Finish running at 2024.02.21.09:07:39
Finish running at 2024.02.21.09:07:39
Finish running at 2024.02.21.09:07:39
Finish running at 2024.02.21.09:07:40
Finish running at 2024.02.21.09:07:40
Finish running at 2024.02.21.09:07:40
[...]
Finish running at 2024.02.21.09:07:41
Finish running at 2024.02.21.09:07:41
Finish running at 2024.02.21.09:07:41
[...]
Finish running at 2024.02.21.09:07:42
Finish running at 2024.02.21.09:07:42
Finish running at 2024.02.21.09:07:42
[...]
Finish running at 2024.02.21.09:07:43
Finish running at 2024.02.21.09:07:43
Finish running at 2024.02.21.09:07:43
[...]
Finish running at 2024.02.21.09:07:44
Finish running at 2024.02.21.09:07:44
Finish running at 2024.02.21.09:07:44
[...]
Finish running at 2024.02.21.09:07:45
Finish running at 2024.02.21.09:07:45
Finish running at 2024.02.21.09:07:45
[...]
Finish running at 2024.02.21.09:07:46
Finish running at 2024.02.21.09:07:46
Finish running at 2024.02.21.09:07:46
[...]
Finish running at 2024.02.21.09:07:47
Finish running at 2024.02.21.09:07:47
Finish running at 2024.02.21.09:07:47
[...]
Finish running at 2024.02.21.09:07:48
Finish running at 2024.02.21.09:07:48
Finish running at 2024.02.21.09:07:48
[...]
Finish running at 2024.02.21.09:07:49
Finish running at 2024.02.21.09:07:49
Finish running at 2024.02.21.09:07:49
[...]
Finish running at 2024.02.21.09:07:50
Finish running at 2024.02.21.09:07:50
Finish running at 2024.02.21.09:07:51
Finish running at 2024.02.21.09:07:52
Finish running at 2024.02.21.09:07:52
Finish running at 2024.02.21.09:07:52
[OVERALL], RunTime(ms), 159139
[OVERALL], Throughput(ops/sec), 10682.485123068513
[TOTAL_GCS_PS_Scavenge], Count, 30
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 2130
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 1.3384525477727018
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 30
[TOTAL_GC_TIME], Time(ms), 2130
[TOTAL_GC_TIME_%], Time(%), 1.3384525477727018
[READ], Operations, 1615266
[READ], AverageLatency(us), 6495.28176659448
[READ], MinLatency(us), 912
[READ], MaxLatency(us), 189439
[READ], 95thPercentileLatency(us), 10599
[READ], 99thPercentileLatency(us), 18047
[READ], Return=OK, 1615266
[CLEANUP], Operations, 100
[CLEANUP], AverageLatency(us), 101635.3
[CLEANUP], MinLatency(us), 817
[CLEANUP], MaxLatency(us), 199295
[CLEANUP], 95thPercentileLatency(us), 182655
[CLEANUP], 99thPercentileLatency(us), 194815
[UPDATE], Operations, 84734
[UPDATE], AverageLatency(us), 53781.69827932117
[UPDATE], MinLatency(us), 5096
[UPDATE], MaxLatency(us), 19709951
[UPDATE], 95thPercentileLatency(us), 152447
[UPDATE], 99thPercentileLatency(us), 253183
[UPDATE], Return=OK, 84734